<b>*Importing libraries*<b>

In [1]:
import pandas as pd
import numpy as np

<b>Basic series in pandas<b>

In [3]:
my_series = pd.Series([1,3,4,np.nan,6,8,9,10])
my_series

0     1.0
1     3.0
2     4.0
3     NaN
4     6.0
5     8.0
6     9.0
7    10.0
dtype: float64

 **NaN** (Not A Number)

<b>*Sample Numpy data*<b>

In [5]:
sample_numpy_data = np.array(np.arange(24)).reshape((6,4))
sample_numpy_data

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23]])

<b>Creating a sample data frame, with column header<b>

In [7]:
sample_df = pd.DataFrame(sample_numpy_data,index=list('123456'),columns=list('ABCD'))
sample_df

    A   B   C   D
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15
5  16  17  18  19
6  20  21  22  23

<b> To find datatpyes (Used dtypes) <b>

In [9]:
sample_df.dtypes

A    int32
B    int32
C    int32
D    int32
dtype: object

<b> head and tail , default is 5 rows <b>

In [10]:
sample_df.head()

    A   B   C   D
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15
5  16  17  18  19

In [11]:
sample_df.tail()

    A   B   C   D
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15
5  16  17  18  19
6  20  21  22  23

In [12]:
sample_df.tail(2)

    A   B   C   D
5  16  17  18  19
6  20  21  22  23

<b>Underlying data : values, index and columns<b>

In [13]:
sample_df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23]])

In [19]:
sample_df.index

Index(['1', '2', '3', '4', '5', '6'], dtype='object')

In [15]:
sample_df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

<b>Quick statistical summary<b>

In [17]:
sample_df.describe()

               A          B          C          D
count   6.000000   6.000000   6.000000   6.000000
mean   10.000000  11.000000  12.000000  13.000000
std     7.483315   7.483315   7.483315   7.483315
min     0.000000   1.000000   2.000000   3.000000
25%     5.000000   6.000000   7.000000   8.000000
50%    10.000000  11.000000  12.000000  13.000000
75%    15.000000  16.000000  17.000000  18.000000
max    20.000000  21.000000  22.000000  23.000000

<b>Control precision of floating point number<b>

In [20]:
pd.set_option('display.precision',2)

<b>*Using set_option(), we can change the default number of rows to be displayed.*<b>

In [21]:
sample_df.describe()

           A      B      C      D
count   6.00   6.00   6.00   6.00
mean   10.00  11.00  12.00  13.00
std     7.48   7.48   7.48   7.48
min     0.00   1.00   2.00   3.00
25%     5.00   6.00   7.00   8.00
50%    10.00  11.00  12.00  13.00
75%    15.00  16.00  17.00  18.00
max    20.00  21.00  22.00  23.00

**Transposing rows and columns**

 **we can transpose dataframe using a keyword (T) which describe Transpose**

In [23]:
sample_df.T

   1  2   3   4   5   6
A  0  4   8  12  16  20
B  1  5   9  13  17  21
C  2  6  10  14  18  22
D  3  7  11  15  19  23

**Sort the data by axis**

<li>Sort by ascending Order

In [26]:
sample_df.sort_index(axis=1,ascending=True)

    A   B   C   D
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15
5  16  17  18  19
6  20  21  22  23

<li>Sort by descending order

In [28]:
sample_df.sort_index(axis=1, ascending=False)

    D   C   B   A
1   3   2   1   0
2   7   6   5   4
3  11  10   9   8
4  15  14  13  12
5  19  18  17  16
6  23  22  21  20

**Sort data within a column**

In [32]:
sample_df.sort_values(by='B',ascending=False)

    A   B   C   D
6  20  21  22  23
5  16  17  18  19
4  12  13  14  15
3   8   9  10  11
2   4   5   6   7
1   0   1   2   3